# from curses.ascii import isblank
import math
import pygame as pyg
from random import random

# class restaurant(isB,isL,isD,inNTOU1,inNTOU2,inNTOUO,):
#     d = 0
#     isB = isB


food_list = ["知路","早點來","海音","二餐拉麵","雅廬韓式料理","胖豆町","大葉食堂","山多利","北寧早餐店","玥成上海美味鮮湯包","肯德基","梁社漢","香廚","飯糰","甲尚堡","More","仁班","麥當勞","良師塾","佳汶","來來","浩克","十二福","美而美","Notte Pasta義大利面","默默吃","威肯","春興","樂樂早午餐","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]
#breakfast_list = ["知路","早點來","海音","北寧早餐店","香廚","飯糰","甲尚堡","More","仁班","M麥當勞","良師塾","佳汶","來來","浩克","十二福","美而美","Notte Pasta義大利面","默默吃","威肯","春興","樂樂早午餐","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]
# lunch_dinner_list = ["二餐拉麵","雅廬韓式料理","胖豆町","大葉食堂","山多利","玥成上海美味鮮湯包","肯德基","梁社漢","香廚","飯糰","甲尚堡","More","仁班","麥當勞","良師塾","佳汶","來來","浩克","十二福","美而美","Notte Pasta義大利面","默默吃","威肯","春興","樂樂早午餐","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]
# outside_list = ["知路","早點來","二餐拉麵","雅廬韓式料理","北寧早餐店","玥成上海美味鮮湯包","肯德基","梁社漢","香廚","飯糰","甲尚堡","More","仁班","麥當勞","佳汶","來來","浩克","十二福","美而美","Notte Pasta義大利面","默默吃","春興","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]

# inside_one_list = ["胖豆町","大葉食堂","山多利","良師塾","威肯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]
# inside_two_list = ["春興","樂樂早午餐","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]
# inside_other_list = ["海音","良師塾","春興","樂樂早午餐","慶有餘麵館","早安美樂寶","好食雞","趕鴨子下湯","阿man早午餐","職人的灶咖 ","吮指王 ","飯丸屋","金園美食館","正宗永和豆漿","五點鐘漢堡總店","來來小吃","坤山麵店(坤山大飯店)","黃杯杯","麥味登","松舍海苔飯捲","晶彩麵飯館","今天我要吃什麼!","正味食堂","找中碗","家鄉牛肉麵","鼎咖哩","八斗子永豆","隆香茶室","芋仔蕃薯x閒聊","十二堂","南非小餐館 HOT CHICKS","歐趴食堂","Hi J 海節餐酒館","同樂豆花"]

a = []
print("請選擇抽取範圍\n")
for i in range(len(food_list)):
    a.append(math.floor(1000000*random()))

for i in range(len(food_list)):
    for j in range(len(food_list) - i):
        if(a[j]<a[j-1]):
            c = a[j]
            d = food_list[j]
            a[j] = a[j-1]
            food_list[j] = food_list[j-1]
            a[j-1] = c
            food_list[j-1] = d

for i in range(len(food_list)):
    print(i+1,", ",food_list[i])

end=0
print("按下任意按鍵關閉視窗\n")
